In [13]:
import pandas as pd 
data = {
    
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'Dana'],
    'Age' : [25,30,28,35],
    'Gender' : ['Female', 'Male','Male', 'Female'],
    'City' : ['NewYork','London', 'Paris', 'Berlin']
}

df = pd.DataFrame(data)
df.describe()

unique = df['City'].nunique()

unique

4

In [10]:
average_age = df['Age'].mean()

average_age

29.5

In [15]:
gender = df['Gender'].value_counts()
gender

Gender
Female    2
Male      2
Name: count, dtype: int64

In [20]:
oldest_person = df.loc[df['Age'].idxmax(), 'Name']
oldest_person

'Dana'

In [38]:
import pandas as pd 
data = {
    
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'Dana'],
    'Math_Score' : [85,75,90,80],
    'Science_Score' : [90,85,80,95],
    }

df2 = pd.DataFrame(data)
df2

   ID     Name  Math_Score  Science_Score
0   1    Alice          85             90
1   2      Bob          75             85
2   3  Charlie          90             80
3   4     Dana          80             95

In [27]:
avg = df2['Math_Score'].mean()
avg

82.5

In [30]:
highest = df2['Science_Score'].max()
highest

95

In [34]:
sum2 = df2['sum'] = df2.Math_Score + df2.Science_Score
sum2
df2

   ID     Name  Math_Score  Science_Score  sum
0   1    Alice          85             90  175
1   2      Bob          75             85  160
2   3  Charlie          90             80  170
3   4     Dana          80             95  175

In [40]:
high_scorer = df["Name"].get(sum2.idxmax())
high_scorer

'Alice'

In [42]:
avg_science = df2['Science_Score'].mean()

avg_math = df2['Math_Score'].mean()

print(avg_science-avg_math)

5.0

In [66]:
# prduct sales

import pandas as pd 
data = {
    
    'ID': [1, 2, 3, 4],
    'Product': ['Apple','Banana','Orange','Mango'],
    'Quantity' : [100,150,120,80],
    'Price_per_Unit' : [2.5,1.8,3.0,2.7],
    }

df3 = pd.DataFrame(data)
df3

   ID Product  Quantity  Price_per_Unit
0   1   Apple       100             2.5
1   2  Banana       150             1.8
2   3  Orange       120             3.0
3   4   Mango        80             2.7

In [68]:
df3['Total_Revenue'] = df3['Quantity'] * df3['Price_per_Unit']


product_max_revenue = df3.loc[df3['Total_Revenue'].idxmax(), 'Product']


average_price_per_unit = df3['Price_per_Unit'].mean()


total_quantity_sold = df3['Quantity'].sum()

num_products = df3['Product'].nunique()


print("Total revenue generated from each product:")
print(df3[['Product', 'Total_Revenue']])

print("\nProduct with the highest total revenue:", product_max_revenue)
print("\nAverage price per unit across all products:", average_price_per_unit)
print("\nTotal quantity of all products sold:", total_quantity_sold)
print("\nNumber of different types of products:", num_products)

Total revenue generated from each product:
  Product  Total_Revenue
0   Apple          250.0
1  Banana          270.0
2  Orange          360.0
3   Mango          216.0

Product with the highest total revenue: Orange

Average price per unit across all products: 2.5

Total quantity of all products sold: 450

Number of different types of products: 4

In [2]:
#customer_feedback

import pandas as pd 
data = {
    'ID' : [1,2,3,4],
    'Customer' : ['Alice','Bob', 'Charlie', 'Dana'],
    'Satisfaction' : [4,3,5,2],
    'Feedback' : ['Good','Average','Excellent','Poor']
    
}

df4 = pd.DataFrame(data)
df4

   ID Customer  Satisfaction   Feedback
0   1    Alice             4       Good
1   2      Bob             3    Average
2   3  Charlie             5  Excellent
3   4     Dana             2       Poor

In [3]:
avg = df4['Satisfaction'].mean()
avg

3.5

In [10]:
feed = df4['Feedback'].value_counts()['Good']
feed

1

In [9]:


count = df4[df4['Feedback'] == 'Good'].shape[0]
print(count)


excellent = (df4[df4['Feedback'] == 'Excellent'].shape[0] / df4.shape[0]) * 100
print(excellent)

lowest = df4.loc[df4['Satisfaction'].idxmin(), 'Customer']
print(lowest)

most = df4['Feedback'].value_counts().idxmax()
print(most)

1
25.0
Dana
Good